HELYXcore-4.4.0/examples/legacy/compressible/rhoCentralFoam/forwardStep/system/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

materialType    fluid;
muModel         scalarFunction1;
kappaModel      kappaPrandtl;
thermodynamics  hConst;
equationOfState perfectGas;
energy          sensibleInternalEnergy;


// Note: these are the properties for a "normalised" inviscid gas
//       for which the speed of sound is 1 m/s at a temperature of 1K
//       and gamma = 7/5
molWeight       11640.3;

thermodynamicsCoeffs
{
    Cp              2.5;
    Hf              0;
}
muModelCoeffs
{
    mu              0;
}
kappaModelCoeffs
{
    Pr              1;
}


// ************************************************************************* //
